HELP_1 = """✅**<u> • اوامر المشرفين :</u>**

**c** اوامر التشغيل بالجروبات .

/pause or /cpause • إيقاف تشغيل الموسيقى مؤقتا.
/resume or /cresume • استئناف الموسيقى المتوقفة مؤقتا.
/mute or /cmute • كتم صوت الموسيقى المشغلة.
/unmute or /cunmute • إلغاء كتم صوت الموسيقى الصامتة.
/skip or /cskip • تخطي تشغيل الموسيقى الحالية.
/stop or /cstop- إيقاف تشغيل الموسيقى.. """

HELP_2 = """✅<u>** أوامر إضافية:**</u>
المطرودين يمكن للمستخدمين استخدام اوامــر المسؤول بدون حقوق المسؤول في الدردشة

/auth [معرف المستخدم] • إضافة مستخدم إلى قائمة المطرودين الخاصة بالمجموعة.
/unauth [معرف المستخدم] • إزالة مستخدم من قائمة المطرودين للمجموعة.
/authusers - تحقق من قائمة المصادقة للمجموعة.."""

HELP_3 = """⚠️**<u> اوامر الحــظر  :</u>**

blacklistchat [معرف القناه] - القائمة السوداء لأي دردشة من استخدام Music Bot
/whitelistchat [معرف القناه] - القائمة البيضاء لأي دردشة مدرجة في القائمة السوداء من استخدام Music Bot
/blacklistedchat - التحقق من جميع الدردشات المدرجة في القائمة السوداء.


👤**<u> اوامر  حــظر الاعضاء :</u>**

block [معرف المستخدم or الرد على مستخدم] - يمنع المستخدم من استخدام اوامــر الروبوت.
/unblock [معرف المستخدم or الرد على مستخدم] - إزالة مستخدم من القائمة المحظورة للبوت.
/blockedusers - التحقق من قوائم المستخدمين المحظورين.
."""

HELP_4 = """🌐**<u> أوامر الاذاعه :</u>**
/broadcast [رسالة أو الرد على رسالة] - بث أي رسالة إلى الدردشات المعروضة في برنامج البوت.

<u> خيارات الإذاعه :</u>

**-pin** : يؤدي ذلك إلى تثبيت رسالتك

**-pinloud** :  سيؤدي ذلك إلى تثبيت رسالتك بإشعار بصوت عال

**-user** :  سيؤدي ذلك إلى بث رسالتك إلى المستخدمين الذين بدأوا تشغيل برنامج الروبوت الخاص بك

**-assistant** : سيؤدي الى بث رسالتك من الحساب المساعد

**-nobot** :  سيؤدي ذلك إلى إجبار الروبوت الخاص بك على عدم بث الرسالة

**مثلا:** `/broadcast -user -assistant -pin Hello Testing`

"""
HELP_5 = """✅<u>**Extra  Commands:**</u>

/loop or /cloop [تمكين/تعطيل] أو [الأرقام بين 1-10] - عند التنشيط، يقوم الروبوت بتكرار تشغيل الموسيقى الحالية إلى 1-10 مرات في الدردشة الصوتية. الافتراضي إلى 10 مرات.

/language أو اكتب  لغه : لتغيير اللغة الإنجليزية إلى اليمنية 

/shuffle or /cshuffle- يقوم بخلط قائمة التشغيل الموجودة في قائمة الانتظار بشكل عشوائي.

/seek or /cseek - Forward Seek the music to your duration

/seekback or /cseekback - Backward Seek the music to your duration

**المطور** لمعرفة مطور البوت وقنوات السورس 

/repo - for repo

/owner - تحقق من هو مالك البوت

/id - لاضهار الايدي الخاص بك 

/lyrics [Music Name] - Searches Lyrics for the particular Music on web.."""

HELP_6 = """✅**<u>Bot's Server Playlists:</u>**

/playlist  - Check Your Saved Playlist On Servers.

/deleteplaylist - Delete any saved music in your playlist

/play  - Start playing Your Saved Playlist from Servers."""

HELP_7 = """✨ **البنج اوامر :**

 /ping- قم باختبار اتصال الروبوت وتحقق من إحصائيات ذاكرة الوصول العشوائي ووحدة المعالجة المركزية وما إلى ذلك الخاصة بالبوت. 
 /stats - احصل على إحصائيات عالمية لأفضل 10 مسارات، وأفضل 10 مستخدمين للبوت، وأفضل 10 محادثات على الروبوت، وأفضل 10 تشغيلًا في الدردشة وما إلى ذلك......"""

HELP_8 = """✅<u>** أوامر التشغيل:**</u>


🎺 | - الاوامر تعمل بدون استخدام اي علامات  •
▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬
◍ - اوامر تشغيل البوت في المجموعات - √

◍ -『 شغل 』
 ثم اسم المقطع الصوتي او الرابط الخاص به  •
◍ -『 /فيديو 』
 ثم اسم مقطع الفيديو او الرابط الخاص به  •
◍ -『 بحث  』
 ثم اسم المقطع المراد تنزيله من موقع اليوتيوب مباشر او الرابط الخاص به  •
◍ -『 /ترسيت 』
 قم بأرسالها ( دآخل المجموعات ) لتحديث قائمه المشرفين بمجموعتك  •
▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬
◍ - جزء القنوات - √
◍ - اوامر تشغيل البوت في القنوات 👇 - √

◍ -『 شغل 』
 ثم اسم المقطع الصوتي او الرابط الخاص به لتشغيله بقناتك  •
◍ -『 /فيديو 』
ثم اسم الفيديو او الرابط الخاص به لتشغيله بقناتك  •
▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼▬࣪▭𝅼"""

HELP_9 = """🔰**<u>ADD & REMOVE SUDO USERS :</u>**

/addsudo [Username or Reply to a user]

/delsudo [Username or Reply to a user]

🛃**<u>HEROKU:</u>**

/usage - Dyno Usage.

🌐**<u>CONFIG VARS:</u>**

/get_var - Get a config var from Heroku or .env.

/del_var - Delete any var on Heroku or .env.

/set_var [Var Name] [Value] - Set a Var or Update a Var on heroku or .env. Seperate Var and its Value with a space.


🤖**<u>BOT COMMANDS:</u>**

/reboot - Reboot your Bot. 
/update - Update Bot.
/speedtest - Check server speeds
/maintenance [enable / disable] 
/logger [enable / disable] - Bot logs the searched queries in logger group.
/get_log [Number of Lines] - Get log of your bot from heroku or vps. Works for both.

⚡️**<u>PRIVATE BOT FUNCTION:</u>**
/authorize [CHAT_ID] - Allow a chat for using your bot.
/unauthorize [CHAT_ID] - Disallow a chat from using your bot.
/authorized - Check all allowed chats of your bot.
"""

HELP_10 = """🤑 **<u>ᴀᴄᴛɪᴠᴇ ᴠɪᴅᴇᴏᴄʜᴀᴛs :</u>**

/activevoice - Check active voice chats on bot.
/activevideo - Check active video calls on bot.
/autoend [enable|disable] - Enable Auto stream end after 3 mins if no one is listening.."""

HELP_11 = """😅**<u> started with bot</u>**
/start : start the bot

/help : Get Commands Helper Menu with detailed explanations of commands..

/reboot : reboot bot for your chat.

/settings - Get a complete group's settings with inline buttons.

/sudolist - Check Sudo Users of Bikash Aditya Player Bot"""

HELP_12 = """👤**<u>GBAN FUNCTION:</u>**

/gban [Username or Reply to a user] - Gban a user from bot's served chat and stop him from using your bot.

/ungban [Username or Reply to a user] - Remove a user from Bot's gbanned List and allow him for using your bot

/gbannedusers - Check Gbanned Users Lists."""
